package org.mpei.ClassWork_11;

public class main {
    /**
     * Два вида систем:
     * - централизованные
     * - мультиагентные (распределенные)
     *
     * Библиотеки:
     * Math(pow, sqrt, abs)
     * util(List, Map)
     *
     * Framework:
     * Jade
     *
     * При запуске аента, в первую очередь запускается платформа (Platform)
     * Платформа - совокупность контейнеров (обязательно содержит main контейнер)
     * Контейнер - совокупность агентов
     *
     * AMS - agent manager system
     * AMS - запускает всех агентов, контролирует их жизненный цикл, рождает и убивает других агентов
     *
     * df - агент справочник*/
}
