package org.mpei.ClassWork_21;

public class Lecture {
    /**
     * Тестирование аукциона:
     *
     * Чтобы проверить, что система работает правильно, необходимо создать тесты.
     *
     * 1. Start Platform (запустить платформу)
     * 2. Test Agent (создаем тестового агента)
     * 3. Beh (создание тестового поведения)
     * 4. Test Params (создание тестовых параметров)
     *
     * Мы не можем проверить сразу все поведения, но можем проверить одну или группу поведений.
     * Тестовые параметры мы задаем сами.
     * Проверка работы поведения будет осуществляться по проверке OnEnd.
     * */

    /**
     * Патерны в программировании
     *
     * Многие задачи были уже давно решены программистами и есть готовый концепт решения таких
     * проблем.
     * */
}
